tutorials/thermoFluidSolidInteraction/thermalCavity/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default none;

    div(phi,U) Gauss linearUpwind cellLimited grad(U) 1;

    div(phi,T) Gauss linearUpwind cellLimited grad(T) 1;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default none;
    laplacian(nuEff,U) Gauss linear corrected;
    laplacian(rAU,p) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;

    laplacian(lambdaEff,T) Gauss linear corrected;
}

snGradSchemes
{
    default         corrected;
}

interpolationSchemes
{
    default         linear;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
